# Pandas Dataframes

## Agenda

1. **About** Dataframes   

2. **Create**   
    A. Object types  
    B. Naming conventions  
    
3. **View**  

4. **Compare**  

5. **Summarize**   

6. **Dataframe Attributes**  

7. **Subset/Filter**  
    A. Columns  
    B. Rows 
        
8. **Drop, Rename, Add Columns**  
    A. Dropping columns  
    B. Renaming columns  
    C. Adding columns   

9. **Sort**

10. **Chain DF Methods**

## About Dataframes

- tabular  
- 2-dimensional   
- provide a number of facilities for manipulating and transforming the data   

**Pandas Help: Functions & Methods**

[Pandas Funtions](https://pandas.pydata.org/pandas-docs/stable/reference/general_functions.html) will begin with `pd`, such as `pd.concat()`. (See link for list of functions.)

Methods are *called on* objects, so [Pandas DataFrame Methods](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html) 
 will be called on dataframes. That means that these will begin with the name of your dataframe, such as `df.info()` where the name of your dataframe is `df`. Similarly, [Series Methods](https://pandas.pydata.org/pandas-docs/stable/reference/series.html) will look like `my_series.T`, as an example. (See links for list of methods.)

In [4]:
import pandas as pd

## Create Dataframes

1. We can pass a dictionary to create a dataframe, where the keys correspond to the names of the columns, and the values associated with those keys will make up the data.  

2. We can also pass lists or arrays to create a dataframe, where each list or array represents a row in the dataframe.   

3. We can copy an existing dataframe into a new dataframe

4. We can also create dataframes by reading data from an existing structured data set, such as a csv, a sql table, or an excel file. 

For this lesson, we will create a dataframe using the existing standings for NBA Western Conference using the first 3 methods above.

**Method 1**  

Pass a dictionary where keys => column names, values => column values. 

`df = pd.DataFrame({'col1': [values], 'col2': [values]})`

In [5]:
teams_col = ['LAL', 'LAC', 'DEN', 'OKC', 'HOU', 'UTA', 'DAL', 
             'POR', 'MEM', 'PHX', 'SAS', 'SAC', 'NO', 'MIN', 'GS']
wins_col = [52, 48, 46, 44, 44, 43, 43, 
            34, 33, 33, 32, 30, 30, 19, 15]
losses_col = [18, 23, 26, 27, 27, 28, 31, 
              39, 39, 39, 38, 41, 41, 45, 50]
games_back_col = [0, 4.5, 7, 8.5, 8.5, 9.5, 11, 
                  19.5, 20, 20, 20, 22.5, 22.5, 30, 34.5]

nba_df_from_dict_as_cols = pd.DataFrame(
    {'team': teams_col, 
     'win': wins_col, 
     'loss': losses_col, 
     'games_back': games_back_col}
)

**Method 2**. 

Pass a list of lists where each nested list is a row in the dataframe.

In [6]:
nba_df_from_lists_as_rows = pd.DataFrame(
    [['LAL', 52, 18, 0], 
     ['LAC', 48, 23, 4.5], 
     ['DEN', 46, 26, 7.0], 
     ['OKC', 44, 27, 8.5], 
     ['HOU', 44, 27, 8.5], 
     ['UTA', 43, 28, 9.5], 
     ['DAL', 43, 31, 11], 
     ['POR', 34, 39, 19.5], 
     ['MEM', 33, 39, 20], 
     ['PHX', 33, 39, 20], 
     ['SAS', 32, 38, 20], 
     ['SAC', 30, 41, 22.5], 
     ['NO', 30, 41, 22.5], 
     ['MIN', 19, 45, 30], 
     ['GS', 15, 50, 34.5]
    ], 
    columns = ['team', 'win', 'loss', 'games_back']
)

**Method 3**

Copy a dataframe from an existing dataframe.

In [7]:
nba_df = nba_df_from_lists_as_rows

### Object Types

Guesses for the type of objects we just created?

In [8]:
type(nba_df)

pandas.core.frame.DataFrame

### Naming Conventions for Dataframes

It is common dataframes to contain `df` in their variable names, as we have here with `nba_df`. In many examples, you may see dataframes simply with the name `df`. In practice, especially if you are working with multiple dataframes, it is good to have a name that will describe what your dataframe contains or how it differs from the other dataframes in your environment, i.e. other dataframes you have created in your notebook or current python session or kernel. For example, when I created the first two dataframes, which are exactly the same, but my purpose is to demonstrate the different ways of creating them, I name them to identify that, albeit ridiculously long names ;). (We will compare them later to prove they are identical, btw).

## View Dataframes

What's in these dataframes we just created? 

1. `nba_df` (without `print()`) gives a nice pretty display
2. `nba_df` (without `print()`) will not work outside of jupyter or ipython.   
3. `print(nba_df)` does not have an `Out[#]`, while `nba_df` does.    
4. `nba_df` (without `print()`) will not return anything if there is a statement following it in the same cell that displays something.

In [6]:
print(nba_df)

nba_df

   team  win  loss  games_back
0   LAL   52    18         0.0
1   LAC   48    23         4.5
2   DEN   46    26         7.0
3   OKC   44    27         8.5
4   HOU   44    27         8.5
5   UTA   43    28         9.5
6   DAL   43    31        11.0
7   POR   34    39        19.5
8   MEM   33    39        20.0
9   PHX   33    39        20.0
10  SAS   32    38        20.0
11  SAC   30    41        22.5
12   NO   30    41        22.5
13  MIN   19    45        30.0
14   GS   15    50        34.5

   team  win  loss  games_back
0   LAL   52    18         0.0
1   LAC   48    23         4.5
2   DEN   46    26         7.0
3   OKC   44    27         8.5
4   HOU   44    27         8.5
5   UTA   43    28         9.5
6   DAL   43    31        11.0
7   POR   34    39        19.5
8   MEM   33    39        20.0
9   PHX   33    39        20.0
10  SAS   32    38        20.0
11  SAC   30    41        22.5
12   NO   30    41        22.5
13  MIN   19    45        30.0
14   GS   15    50        34.5

In [7]:
nba_df

print(nba_df)

   team  win  loss  games_back
0   LAL   52    18         0.0
1   LAC   48    23         4.5
2   DEN   46    26         7.0
3   OKC   44    27         8.5
4   HOU   44    27         8.5
5   UTA   43    28         9.5
6   DAL   43    31        11.0
7   POR   34    39        19.5
8   MEM   33    39        20.0
9   PHX   33    39        20.0
10  SAS   32    38        20.0
11  SAC   30    41        22.5
12   NO   30    41        22.5
13  MIN   19    45        30.0
14   GS   15    50        34.5

## Compare Dataframes

Are nba_df_from_dict_as_cols and nba_df_from_lists_as_rows 
equivalent dataframes? Don't take my word for it. 

remember from numpy... `(my_array < 0).all()`?

In [8]:
(nba_df_from_dict_as_cols == nba_df_from_lists_as_rows).all()

team          True
win           True
loss          True
games_back    True
dtype: bool

## Summarize Dataframes

- `df.info()`:  See total number of rows, column names, number of non-null values for each column, datatype of each column, size of the dataframe (memory usage) 

- `df.describe()`: Summary statistics of all the columns with numeric datatypes.

In [9]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
team          15 non-null object
win           15 non-null int64
loss          15 non-null int64
games_back    15 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 608.0+ bytes

In [10]:
nba_df.describe()

             win       loss  games_back
count  15.000000  15.000000   15.000000
mean   36.400000  34.133333   15.866667
std    10.568146   9.062219    9.753144
min    15.000000  18.000000    0.000000
25%    31.000000  27.000000    8.500000
50%    34.000000  38.000000   19.500000
75%    44.000000  40.000000   21.250000
max    52.000000  50.000000   34.500000

## Dataframe Attributes

- `df.dtypes`: datatype of each column
- `df.shape`: tuple of number of rows & columns in the dataframe
- `df.index`: the labels for each row (usually autogenerated int)
- `df.columns`: you can also assign new values to this attribute. 

You will notice that when calling these attributes of dataframes, they are not followed by `()`. When you forget, you will just get a nice error to remind you :)

In [11]:
print(nba_df.dtypes)
type(nba_df.dtypes)

team           object
win             int64
loss            int64
games_back    float64
dtype: object

pandas.core.series.Series

In [12]:
nba_df.shape

(15, 4)

In [13]:
type(nba_df.shape)

tuple

In [14]:
nba_df.shape[0]

15

In [15]:
nba_df.index
# type(nba_df.index)

RangeIndex(start=0, stop=15, step=1)

In [16]:
nba_df.columns
# type(nba_df.columns)
# column names are also an index, like rows. Axis 0 = Rows, Axis 1 = Columns

Index(['team', 'win', 'loss', 'games_back'], dtype='object')

In [17]:
# rename the columns using the .columns attribute
nba_df.columns = [col.upper() for col in nba_df.columns]
nba_df.columns = [col.lower() for col in nba_df.columns]

## Subset/Filter Dataframes

### Columns

Return a dataframe

- `df[[col1, col2]]`  
- `df[[col1]]`  
- `mycols = [col1, col2]` -> `df[mycols]`  

Return a series
- `df[col1]`  
- `df.col1`

In [18]:
# nba_df[['team', 'games_back']]

my_cols = ['team', 'games_back']
nba_df[my_cols]

   team  games_back
0   LAL         0.0
1   LAC         4.5
2   DEN         7.0
3   OKC         8.5
4   HOU         8.5
5   UTA         9.5
6   DAL        11.0
7   POR        19.5
8   MEM        20.0
9   PHX        20.0
10  SAS        20.0
11  SAC        22.5
12   NO        22.5
13  MIN        30.0
14   GS        34.5

In [19]:
# return a single column dataframe
print(nba_df[['team']])
# type(nba_df[['team']])

# dataframe will have a column index while series will not, it will instead have a name for the series, 
# which was the column name 'team'

   team
0   LAL
1   LAC
2   DEN
3   OKC
4   HOU
5   UTA
6   DAL
7   POR
8   MEM
9   PHX
10  SAS
11  SAC
12   NO
13  MIN
14   GS

In [20]:
# return a series. 
print(nba_df['team'])

0     LAL
1     LAC
2     DEN
3     OKC
4     HOU
5     UTA
6     DAL
7     POR
8     MEM
9     PHX
10    SAS
11    SAC
12     NO
13    MIN
14     GS
Name: team, dtype: object

In [21]:
# also can return a series through df.colname
type(nba_df.team)

pandas.core.series.Series

### Rows

We can take a peek at the first 5 rows, last 5 rows, a random sample, or anything in between. 

- `df.head()`: first n rows (default n = 5)  
- `df.tail()`: last n rows (default n = 5)  
- `df.sample(n)`: sample n rows  
- `df.sample(frac)`: sample frac (proportion) of rows     
- `df[df.col1 < x]`: all columns and all rows where col1 value is less than x

In [22]:
nba_df.head(1)

nba_df.tail(1)

nba_df.sample(3, random_state = 123)

   team  win  loss  games_back
7   POR   34    39        19.5
10  SAS   32    38        20.0
4   HOU   44    27         8.5

In [23]:
nba_df.sample(3, random_state = 123)

   team  win  loss  games_back
7   POR   34    39        19.5
10  SAS   32    38        20.0
4   HOU   44    27         8.5

In [24]:
nba_df.sample(frac=.20, random_state=123)

   team  win  loss  games_back
7   POR   34    39        19.5
10  SAS   32    38        20.0
4   HOU   44    27         8.5

In [25]:
nba_df[nba_df.games_back < 21]

   team  win  loss  games_back
0   LAL   52    18         0.0
1   LAC   48    23         4.5
2   DEN   46    26         7.0
3   OKC   44    27         8.5
4   HOU   44    27         8.5
5   UTA   43    28         9.5
6   DAL   43    31        11.0
7   POR   34    39        19.5
8   MEM   33    39        20.0
9   PHX   33    39        20.0
10  SAS   32    38        20.0

### Columns & Rows

- `df[df.col1 < x].col2`: column 2 and rows where col1 value is less than x. What kind of object is returned?     
- `df[df.col1 < x][[col1, col2]]`: columns 1 & 2 and rows where col1 value is less than x. What kind of object is returned?

In [26]:
nba_df[nba_df.games_back < 21].team
nba_df[nba_df.games_back < 21][['team', 'win', 'loss']]

   team  win  loss
0   LAL   52    18
1   LAC   48    23
2   DEN   46    26
3   OKC   44    27
4   HOU   44    27
5   UTA   43    28
6   DAL   43    31
7   POR   34    39
8   MEM   33    39
9   PHX   33    39
10  SAS   32    38

## Drop, Rename, Add Columns


- `df.drop(colums=[])`
- `df.rename(columns={'original_name': 'new_name'})`
- `df['new_col'] = df.col1 < x`
- `df.assign(new_col=df.col1 < x)`

In the drop and rename methods (and many others in pandas), the original dataframe is not changed, but instead a new dataframe is produced. However, you can use the `inplace` argument to change the original dataframe.

In [28]:
# drop columns 

nba_df.drop(columns=['loss']).head(1)
# nba_df.drop(columns=['loss'], inplace=True)

# cols_to_remove = ['col1', 'col2']
# nba_df.drop(columns = cols_to_remove)

  team  win  games_back
0  LAL   52         0.0

In [30]:
# rename columns 

nba_df.columns = ['team', 'w', 'l', 'gb']
nba_df.columns

Index(['team', 'w', 'l', 'gb'], dtype='object')

In [34]:
# rename columns 

nba_df.rename(columns={'w': 'win', 'l': 'loss', 'gb': 'games_back'}, inplace=True)
nba_df.columns

Index(['team', 'win', 'loss', 'games_back'], dtype='object')

In [35]:
# create new columns 

nba_df['win_pct'] = nba_df.win/(nba_df.win + nba_df.loss)
nba_df.head()

  team  win  loss  games_back   win_pct
0  LAL   52    18         0.0  0.742857
1  LAC   48    23         4.5  0.676056
2  DEN   46    26         7.0  0.638889
3  OKC   44    27         8.5  0.619718
4  HOU   44    27         8.5  0.619718

In [42]:
# first drop the column we just created to start from scratch and demo
nba_df.drop(columns = ['win_pct'], inplace = True)
nba_df

   team  win  loss  games_back
0   LAL   52    18         0.0
1   LAC   48    23         4.5
2   DEN   46    26         7.0
3   OKC   44    27         8.5
4   HOU   44    27         8.5
5   UTA   43    28         9.5
6   DAL   43    31        11.0
7   POR   34    39        19.5
8   MEM   33    39        20.0
9   PHX   33    39        20.0
10  SAS   32    38        20.0
11  SAC   30    41        22.5
12   NO   30    41        22.5
13  MIN   19    45        30.0
14   GS   15    50        34.5

In [48]:
# create new column win_pct using assign
nba_df = nba_df.assign(win_pct = nba_df.win/(nba_df.win + nba_df.loss))
nba_df.head()

  team  win  loss  games_back   win_pct
0  LAL   52    18         0.0  0.742857
1  LAC   48    23         4.5  0.676056
2  DEN   46    26         7.0  0.638889
3  OKC   44    27         8.5  0.619718
4  HOU   44    27         8.5  0.619718

## Sort Dataframes

- `df.sort_values(by='col1', ascending=False)`: default is True, so `ascending` argument is not necessary if sorting in ascending order.

In [52]:
# nba_df.sort_values(by='win_pct', ascending=False)
nba_df.sort_values(by='win_pct')

   team  win  loss  games_back   win_pct
14   GS   15    50        34.5  0.230769
13  MIN   19    45        30.0  0.296875
11  SAC   30    41        22.5  0.422535
12   NO   30    41        22.5  0.422535
10  SAS   32    38        20.0  0.457143
8   MEM   33    39        20.0  0.458333
9   PHX   33    39        20.0  0.458333
7   POR   34    39        19.5  0.465753
6   DAL   43    31        11.0  0.581081
5   UTA   43    28         9.5  0.605634
3   OKC   44    27         8.5  0.619718
4   HOU   44    27         8.5  0.619718
2   DEN   46    26         7.0  0.638889
1   LAC   48    23         4.5  0.676056
0   LAL   52    18         0.0  0.742857

In [55]:
nba_df_low_to_high = nba_df.sort_values(by='win_pct').reset_index().drop(columns=['index'])
nba_df_low_to_high.head()

  team  win  loss  games_back   win_pct
0   GS   15    50        34.5  0.230769
1  MIN   19    45        30.0  0.296875
2  SAC   30    41        22.5  0.422535
3   NO   30    41        22.5  0.422535
4  SAS   32    38        20.0  0.457143

## Chain Dataframe Methods

As long as each method is returning a dataframe, these can be chained together to quickly and easily create the dataframe you need.

In [56]:
# just to start fresh
nba_df.drop(columns=['win_pct'], inplace=True)

In [63]:
# find the teams that would be in playoffs today if it started right now. 
# find the top 8 teams by win_pct

nba_df.\
    assign(win_pct = nba_df.win/(nba_df.win + nba_df.loss)).\
    sort_values(by='win_pct', ascending=False).\
    nlargest(8, 'win_pct', keep='all')

  team  win  loss  games_back   win_pct
0  LAL   52    18         0.0  0.742857
1  LAC   48    23         4.5  0.676056
2  DEN   46    26         7.0  0.638889
3  OKC   44    27         8.5  0.619718
4  HOU   44    27         8.5  0.619718
5  UTA   43    28         9.5  0.605634
6  DAL   43    31        11.0  0.581081
7  POR   34    39        19.5  0.465753

In [67]:
nba_df.\
    assign(win_pct = nba_df.win/(nba_df.win + nba_df.loss)).\
    sort_values(by='win_pct', ascending=False).head(8)

  team  win  loss  games_back   win_pct
0  LAL   52    18         0.0  0.742857
1  LAC   48    23         4.5  0.676056
2  DEN   46    26         7.0  0.638889
3  OKC   44    27         8.5  0.619718
4  HOU   44    27         8.5  0.619718
5  UTA   43    28         9.5  0.605634
6  DAL   43    31        11.0  0.581081
7  POR   34    39        19.5  0.465753

In [74]:
nba_df.\
    assign(win_pct = nba_df.win/(nba_df.win + nba_df.loss)).\
    sort_values(by='win_pct', ascending=False).\
    reset_index().\
    assign(rank = nba_df.index + 1).\
    drop(columns=['index']).head(8)

  team  win  loss  games_back   win_pct  rank
0  LAL   52    18         0.0  0.742857     1
1  LAC   48    23         4.5  0.676056     2
2  DEN   46    26         7.0  0.638889     3
3  OKC   44    27         8.5  0.619718     4
4  HOU   44    27         8.5  0.619718     5
5  UTA   43    28         9.5  0.605634     6
6  DAL   43    31        11.0  0.581081     7
7  POR   34    39        19.5  0.465753     8

## Series vs. Dataframe

In [61]:
s_values = ['LAL', 'LAC', 'DEN', 'OKC']
s_name = 'team'
s_index = [0, 1, 2, 3]
s_dtype = 'str'

s_teams = pd.Series(data=s_values, 
                    index=s_index,  
                    dtype=s_dtype, 
                    name=s_name)

In [62]:
print("name: ", s_teams.name,  "\ncolumns: NA\nindex: ", s_teams.index, "\naxes: ", s_teams.axes, "\ndtypes: ", s_teams.dtypes, 
      "\nndim: ", s_teams.ndim, "\nsize: ", s_teams.size, "\nshape: ", s_teams.shape, "\nvalues: ", s_teams.values)

name:  team
columns: NA
index:  Int64Index([0, 1, 2, 3], dtype='int64')
axes:  [Int64Index([0, 1, 2, 3], dtype='int64')]
dtypes:  object
ndim:  1
size:  4
shape:  (4,)
values:  ['LAL' 'LAC' 'DEN' 'OKC']

In [63]:
s_values = [52, 48, 46, 44]
s_name = 'wins'
s_index = [0, 1, 2, 3]
s_dtype = 'int'

s_wins = pd.Series(data=s_values, 
                    index=s_index,  
                    dtype=s_dtype, 
                    name=s_name)

In [64]:
print("name: ", s_wins.name,  "\ncolumns: NA\nindex: ", s_wins.index, "\naxes: ", s_wins.axes, "\ndtypes: ", s_wins.dtypes, 
      "\nndim: ", s_wins.ndim, "\nsize: ", s_wins.size, "\nshape: ", s_wins.shape, "\nvalues: ", s_wins.values)

name:  wins
columns: NA
index:  Int64Index([0, 1, 2, 3], dtype='int64')
axes:  [Int64Index([0, 1, 2, 3], dtype='int64')]
dtypes:  int64
ndim:  1
size:  4
shape:  (4,)
values:  [52 48 46 44]

In [65]:
df = pd.DataFrame({'team': s_teams, 'wins': s_wins})

print("name: NA\ncolumns: ", df.columns, "\nindex: ", df.index, "\naxes: ", df.axes, 
      "\ndtypes: ", df.dtypes, "\nndim: ", df.ndim, "\nsize: ", df.size, 
      "\nshape: ", df.shape, "\nvalues: ", df.values)
# data=None, index=None, columns=None, dtype=None, copy=Fals

name: NA
columns:  Index(['team', 'wins'], dtype='object')
index:  Int64Index([0, 1, 2, 3], dtype='int64')
axes:  [Int64Index([0, 1, 2, 3], dtype='int64'), Index(['team', 'wins'], dtype='object')]
dtypes:  team    object
wins     int64
dtype: object
ndim:  2
size:  8
shape:  (4, 2)
values:  [['LAL' 52]
 ['LAC' 48]
 ['DEN' 46]
 ['OKC' 44]]

In [66]:
df['team']

df[['team']]

  team
0  LAL
1  LAC
2  DEN
3  OKC